In [1]:
import mysql.connector as connection
import pandas as pd

In [2]:
sql = "SELECT * FROM classicmodels.orders;"

In [3]:
db=connection.connect(host='localhost',database='classicmodels',user='root',passwd='0000',use_pure=True)

In [4]:
df=pd.read_sql(sql,db)

D:\Code\ETL\ETL-Python-Scripts\etl_env\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [5]:
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141

In [6]:
# Checking NA in all rows and removing them

In [7]:
for column in df.columns:
    print(column,"->",df[column].isna().sum())

orderNumber -> 0
orderDate -> 0
requiredDate -> 0
shippedDate -> 14
status -> 0
comments -> 246
customerNumber -> 0

In [8]:
df.dropna(inplace=True)

In [9]:
# confirming if they are dropped

In [10]:
for column in df.columns:
    print(column,"->",df[column].isna().sum())

orderNumber -> 0
orderDate -> 0
requiredDate -> 0
shippedDate -> 0
status -> 0
comments -> 0
customerNumber -> 0

In [11]:
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
7,10107,2003-02-24,2003-03-03,2003-02-26,Shipped,Difficult to negotiate with customer. We need ...,131
9,10109,2003-03-10,2003-03-19,2003-03-11,Shipped,Customer requested that FedEx Ground is used f...,486
12,10112,2003-03-24,2003-04-03,2003-03-29,Shipped,Customer requested that ad materials (such as ...,144
18,10118,2003-04-21,2003-04-29,2003-04-26,Shipped,Customer has worked with some of our vendors i...,216

In [12]:
set(df['status'])

{'Cancelled', 'Disputed', 'Resolved', 'Shipped'}

In [13]:
for status in set(df['status']):
    print(status,"->",list(df['status']).count(status))

Shipped -> 62
Resolved -> 4
Disputed -> 3
Cancelled -> 2

In [14]:
df.to_excel("mysql_data.xlsx",index=False)

In [15]:
db.close()